ontwikkel_nvwa/foutupdfrom_to.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v4="http://ec.europa.eu/sanco/tracesnt/base/v4" xmlns:oas="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:v1="http://ec.europa.eu/tracesnt/referencedata/v1" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
    <soapenv:Header>
        <v4:LanguageCode>nl</v4:LanguageCode>
        <v4:WebServiceClientId>vgc-client</v4:WebServiceClientId>
        <oas:Security>
            <oas:UsernameToken wsu:Id="UsernameToken-A5B8D7123A55CB6A75153751937547586">
                <oas:Username>n0039qig</oas:Username>
                <oas:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest">BZ6y+hc9zphvxXY3F1UQzOJBfi4=</oas:Password>
                <oas:Nonce>Zm90UVZhS2FDSmhkeEFEUQ==</oas:Nonce>
                <wsu:Created>2022-11-28T13:58:26.868Z</wsu:Created>
            </oas:UsernameToken>
            <wsu:Timestamp>
                <wsu:Created>2022-11-28T13:58:26.868Z</wsu:Created>
                <wsu:Expires>2022-11-28T14:01:26.000Z</wsu:Expires>
            </wsu:Timestamp>
        </oas:Security>
    </soapenv:Header>
    <soapenv:Body>
        <v1:GetClassificationTreeUpdatesRequest>
            <v1:TreeID>chedp</v1:TreeID>
            <v1:UpdateDateTimeRange>
                <v4:From>01-AUG-22 01.00.00.000000000 AM</v4:From>
                <v4:To>10-AUG-22 01.00.00.000000000 AM</v4:To>
            </v1:UpdateDateTimeRange>
        </v1:GetClassificationTreeUpdatesRequest>
    </soapenv:Body>
</soapenv:Envelope>
